import cdsapi

c = cdsapi.Client()

# 下载 PJME 地区的气象数据
# 范围：North 42, West -80, South 38, East -74 (涵盖宾州东部、新泽西、特拉华)
# 我们下载两个变量：总云量(TCC)代表云图，2米温度(2T)代表热力图

c.retrieve(
    'reanalysis-era5-single-levels',
    {
        'product_type': 'reanalysis',
        'format': 'netcdf', # 下载为科学数据格式，后续我们转成图片
        'variable': [
            'total_cloud_cover', '2m_temperature',
        ],
        'year': '2018', # 建议先下一年跑通流程
        'month': [
            '01', 
            '02', '03', '04', '05', '06',
            '07', '08', '09', '10', '11', '12',
        ],
        'day': [
            '01', '02', '03', '04', '05', '06',
            '07', '08', '09', '10', '11', '12',
            '13', '14', '15', '16', '17', '18',
            '19', '20', '21', '22', '23', '24',
            '25', '26', '27', '28', '29', '30', '31',
        ],
        'time': [
            '00:00', '01:00', '02:00', '03:00', '04:00', '05:00',
            '06:00', '07:00', '08:00', '09:00', '10:00', '11:00',
            '12:00', '13:00', '14:00', '15:00', '16:00', '17:00',
            '18:00', '19:00', '20:00', '21:00', '22:00', '23:00',
        ],
        'area': [
            42, -80, 38, -74, # N, W, S, E
        ],
    },
    'download_weather_2018.nc')